In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("data4.csv")

In [3]:
df

      Name   Age   Join Date    Salary         City
0    Alice  25.0  05-03-2021   $50,000     new york
1      Bob   NaN  05-03-2021  55000USD     New York
2  Charlie  29.0  07-03-2021       NaN  Los angeles
3    Alice  25.0  05-03-2021   $50,000     new york
4    Diana  22.0  08-03-2021     60000  los angeles

In [4]:
df.fillna(0)

      Name   Age   Join Date    Salary         City
0    Alice  25.0  05-03-2021   $50,000     new york
1      Bob   0.0  05-03-2021  55000USD     New York
2  Charlie  29.0  07-03-2021         0  Los angeles
3    Alice  25.0  05-03-2021   $50,000     new york
4    Diana  22.0  08-03-2021     60000  los angeles

In [5]:
df["Age"] = df["Age"].fillna(df["Age"].mean())

In [6]:
df

      Name    Age   Join Date    Salary         City
0    Alice  25.00  05-03-2021   $50,000     new york
1      Bob  25.25  05-03-2021  55000USD     New York
2  Charlie  29.00  07-03-2021       NaN  Los angeles
3    Alice  25.00  05-03-2021   $50,000     new york
4    Diana  22.00  08-03-2021     60000  los angeles

In [8]:
df["Join Date"] = pd.to_datetime(df["Join Date"])

In [9]:
df

      Name    Age  Join Date    Salary         City
0    Alice  25.00 2021-05-03   $50,000     new york
1      Bob  25.25 2021-05-03  55000USD     New York
2  Charlie  29.00 2021-07-03       NaN  Los angeles
3    Alice  25.00 2021-05-03   $50,000     new york
4    Diana  22.00 2021-08-03     60000  los angeles

In [10]:
df.fillna(0)

      Name    Age  Join Date    Salary         City
0    Alice  25.00 2021-05-03   $50,000     new york
1      Bob  25.25 2021-05-03  55000USD     New York
2  Charlie  29.00 2021-07-03         0  Los angeles
3    Alice  25.00 2021-05-03   $50,000     new york
4    Diana  22.00 2021-08-03     60000  los angeles

In [12]:
df["Salary"].str.replace("USD","$")

0    $50,000
1     55000$
2        NaN
3    $50,000
4      60000
Name: Salary, dtype: object

In [15]:
df["City"]=df["City"].str.capitalize()

In [16]:
df

      Name    Age  Join Date    Salary         City
0    Alice  25.00 2021-05-03   $50,000     New york
1      Bob  25.25 2021-05-03  55000USD     New york
2  Charlie  29.00 2021-07-03       NaN  Los angeles
3    Alice  25.00 2021-05-03   $50,000     New york
4    Diana  22.00 2021-08-03     60000  Los angeles

In [18]:
df.dtypes

Name                 object
Age                 float64
Join Date    datetime64[ns]
Salary               object
City                 object
dtype: object

In [19]:
df["Age"] = df["Age"].astype(int)

In [20]:
df

      Name  Age  Join Date    Salary         City
0    Alice   25 2021-05-03   $50,000     New york
1      Bob   25 2021-05-03  55000USD     New york
2  Charlie   29 2021-07-03       NaN  Los angeles
3    Alice   25 2021-05-03   $50,000     New york
4    Diana   22 2021-08-03     60000  Los angeles

In [21]:
df.dtypes

Name                 object
Age                   int64
Join Date    datetime64[ns]
Salary               object
City                 object
dtype: object